---
kind: method
id: M:Autodesk.Revit.DB.IFC.ImporterIFC.GetOptions
source: html/86a8602c-c23f-0170-33b6-04a6e53a8d54.htm
---
# Autodesk.Revit.DB.IFC.ImporterIFC.GetOptions Method

Gets the collection of named options set by the importer client.

## Syntax (C#)
```csharp
public IDictionary<string, string> GetOptions()
```

## Returns
The collection of named options.